/* automatically generated by rust-bindgen 0.59.0 */

#![allow(dead_code)]
#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(deref_nullptr)]

pub const __PRI_8_LENGTH_MODIFIER__: &'static [u8; 3usize] = b"hh\0";
pub const __PRI_64_LENGTH_MODIFIER__: &'static [u8; 3usize] = b"ll\0";
pub const __SCN_64_LENGTH_MODIFIER__: &'static [u8; 3usize] = b"ll\0";
pub const __PRI_MAX_LENGTH_MODIFIER__: &'static [u8; 2usize] = b"j\0";
pub const __SCN_MAX_LENGTH_MODIFIER__: &'static [u8; 2usize] = b"j\0";
pub const PRId8: &'static [u8; 4usize] = b"hhd\0";
pub const PRIi8: &'static [u8; 4usize] = b"hhi\0";
pub const PRIo8: &'static [u8; 4usize] = b"hho\0";
pub const PRIu8: &'static [u8; 4usize] = b"hhu\0";
pub const PRIx8: &'static [u8; 4usize] = b"hhx\0";
pub const PRIX8: &'static [u8; 4usize] = b"hhX\0";
pub const PRId16: &'static [u8; 3usize] = b"hd\0";
pub const PRIi16: &'static [u8; 3usize] = b"hi\0";
pub const PRIo16: &'static [u8; 3usize] = b"ho\0";
pub const PRIu16: &'static [u8; 3usize] = b"hu\0";
pub const PRIx16: &'static [u8; 3usize] = b"hx\0";
pub const PRIX16: &'static [u8; 3usize] = b"hX\0";
pub const PRId32: &'static [u8; 2usize] = b"d\0";
pub const PRIi32: &'static [u8; 2usize] = b"i\0";
pub const PRIo32: &'static [u8; 2usize] = b"o\0";
pub const PRIu32: &'static [u8; 2usize] = b"u\0";
pub const PRIx32: &'static [u8; 2usize] = b"x\0";
pub const PRIX32: &'static [u8; 2usize] = b"X\0";

pub const __PTHREAD_CONDATTR_SIZE__: u32 = 8;
pub const __PTHREAD_COND_SIZE__: u32 = 40;
pub const __PTHREAD_ONCE_SIZE__: u32 = 8;
pub const __PTHREAD_RWLOCK_SIZE__: u32 = 192;
pub const __PTHREAD_RWLOCKATTR_SIZE__: u32 = 16;
pub const __DARWIN_WCHAR_MIN: i32 = -2147483648;
pub const _FORTIFY_SOURCE: u32 = 2;
pub const __WORDSIZE: u32 = 64;
pub const INT8_MAX: u32 = 127;
pub const INT16_MAX: u32 = 32767;
pub const INT32_MAX: u32 = 2147483647;
pub const INT64_MAX: u64 = 9223372036854775807;
pub const INT8_MIN: i32 = -128;
pub const INT16_MIN: i32 = -32768;
pub const INT32_MIN: i32 = -2147483648;
pub const INT64_MIN: i64 = -9223372036854775808;
pub const UINT8_MAX: u32 = 255;
pub const UINT16_MAX: u32 = 65535;
pub const UINT32_MAX: u32 = 4294967295;
pub const UINT64_MAX: i32 = -1;
pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST64_MIN: i64 = -9223372036854775808;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const INT_LEAST64_MAX: u64 = 9223372036854775807;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const UINT_LEAST64_MAX: i32 = -1;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i32 = -32768;
pub const INT_FAST32_MIN: i32 = -2147483648;
pub const INT_FAST64_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u32 = 32767;
pub const INT_FAST32_MAX: u32 = 2147483647;
pub const INT_FAST64_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: u32 = 65535;
pub const UINT_FAST32_MAX: u32 = 4294967295;
pub const UINT_FAST64_MAX: i32 = -1;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const UINTPTR_MAX: i32 = -1;
pub const SIZE_MAX: i32 = -1;
pub const RSIZE_MAX: i32 = -1;
pub const WINT_MIN: i32 = -2147483648;
pub const WINT_MAX: u32 = 2147483647;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        128usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__mbstate8 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__mbstate8)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>()))._mbstateL as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(_mbstateL)
        )
    );
}
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
pub type __darwin_nl_item = ::std::os::raw::c_int;
pub type __darwin_wctrans_t = ::std::os::raw::c_int;
pub type __darwin_wctype_t = __uint32_t;
pub type wchar_t = __darwin_wchar_t;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
extern "C" {
    pub fn imaxabs(j: intmax_t) -> intmax_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    assert_eq!(
        ::std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
pub type size_t = ::std::os::raw::c_ulong;
pub type rsize_t = ::std::os::raw::c_ulong;
pub type max_align_t = u128;
extern "C" {
    pub fn aws_crt_init();
}
extern "C" {
    pub fn aws_crt_clean_up();
}
extern "C" {
    pub fn aws_crt_test_error(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aws_allocator {
    _unused: [u8; 0],
}
pub type aws_crt_allocator = aws_allocator;
extern "C" {
    pub fn aws_crt_default_allocator() -> *mut aws_crt_allocator;
}
extern "C" {
    pub fn aws_crt_mem_acquire(size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn aws_crt_mem_calloc(
        element_count: size_t,
        element_size: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn aws_crt_mem_release(mem: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn aws_crt_mem_bytes() -> u64;
}
extern "C" {
    pub fn aws_crt_mem_count() -> u64;
}
extern "C" {
    pub fn aws_crt_mem_dump();
}
extern "C" {
    pub fn aws_crt_last_error() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aws_crt_error_str(arg1: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aws_crt_error_name(arg1: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aws_crt_error_debug_str(arg1: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aws_crt_reset_error();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aws_event_loop_group {
    _unused: [u8; 0],
}
pub type aws_crt_event_loop_group = aws_event_loop_group;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _aws_crt_event_loop_group_options {
    _unused: [u8; 0],
}
pub type aws_crt_event_loop_group_options = _aws_crt_event_loop_group_options;
extern "C" {
    pub fn aws_crt_event_loop_group_options_new() -> *mut aws_crt_event_loop_group_options;
}
extern "C" {
    pub fn aws_crt_event_loop_group_options_release(options: *mut aws_crt_event_loop_group_options);
}
extern "C" {
    pub fn aws_crt_event_loop_group_options_set_max_threads(
        options: *mut aws_crt_event_loop_group_options,
        max_threads: u16,
    );
}
extern "C" {
    pub fn aws_crt_event_loop_group_new(
        options: *const aws_crt_event_loop_group_options,
    ) -> *mut aws_crt_event_loop_group;
}
extern "C" {
    pub fn aws_crt_event_loop_group_acquire(
        elg: *mut aws_crt_event_loop_group,
    ) -> *mut aws_crt_event_loop_group;
}
extern "C" {
    pub fn aws_crt_event_loop_group_release(elg: *mut aws_crt_event_loop_group);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aws_input_stream {
    _unused: [u8; 0],
}
pub type aws_crt_input_stream = aws_input_stream;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _aws_crt_input_stream_options {
    _unused: [u8; 0],
}
pub type aws_crt_input_stream_options = _aws_crt_input_stream_options;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _aws_crt_input_stream_status {
    pub is_end_of_stream: bool,
    pub is_valid: bool,
}
#[test]
fn bindgen_test_layout__aws_crt_input_stream_status() {
    assert_eq!(
        ::std::mem::size_of::<_aws_crt_input_stream_status>(),
        2usize,
        concat!("Size of: ", stringify!(_aws_crt_input_stream_status))
    );
    assert_eq!(
        ::std::mem::align_of::<_aws_crt_input_stream_status>(),
        1usize,
        concat!("Alignment of ", stringify!(_aws_crt_input_stream_status))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_aws_crt_input_stream_status>())).is_end_of_stream as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_aws_crt_input_stream_status),
            "::",
            stringify!(is_end_of_stream)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_aws_crt_input_stream_status>())).is_valid as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_aws_crt_input_stream_status),
            "::",
            stringify!(is_valid)
        )
    );
}
pub type aws_crt_input_stream_status = _aws_crt_input_stream_status;
pub const aws_crt_input_stream_seek_basis_AWS_CRT_STREAM_SEEK_BASIS_BEGIN:
    aws_crt_input_stream_seek_basis = 0;
pub const aws_crt_input_stream_seek_basis_AWS_CRT_STREAM_SEEK_BASIS_END:
    aws_crt_input_stream_seek_basis = 2;
pub type aws_crt_input_stream_seek_basis = ::std::os::raw::c_uint;
pub type aws_crt_input_stream_seek_fn = ::std::option::Option<
    unsafe extern "C" fn(
        user_data: *mut ::std::os::raw::c_void,
        offset: i64,
        seek_basis: aws_crt_input_stream_seek_basis,
    ) -> ::std::os::raw::c_int,
>;
pub type aws_crt_input_stream_read_fn = ::std::option::Option<
    unsafe extern "C" fn(
        user_data: *mut ::std::os::raw::c_void,
        dest: *mut u8,
        dest_length: size_t,
    ) -> ::std::os::raw::c_int,
>;
pub type aws_crt_input_stream_get_status_fn = ::std::option::Option<
    unsafe extern "C" fn(
        user_data: *mut ::std::os::raw::c_void,
        out_status: *mut aws_crt_input_stream_status,
    ) -> ::std::os::raw::c_int,
>;
pub type aws_crt_input_stream_get_length_fn = ::std::option::Option<
    unsafe extern "C" fn(
        user_data: *mut ::std::os::raw::c_void,
        out_length: *mut i64,
    ) -> ::std::os::raw::c_int,
>;
pub type aws_crt_input_stream_destroy_fn =
    ::std::option::Option<unsafe extern "C" fn(user_data: *mut ::std::os::raw::c_void)>;
extern "C" {
    pub fn aws_crt_input_stream_options_new() -> *mut aws_crt_input_stream_options;
}
extern "C" {
    pub fn aws_crt_input_stream_options_release(options: *mut aws_crt_input_stream_options);
}
extern "C" {
    pub fn aws_crt_input_stream_options_set_user_data(
        options: *mut aws_crt_input_stream_options,
        user_data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn aws_crt_input_stream_options_set_seek(
        options: *mut aws_crt_input_stream_options,
        seek_fn: aws_crt_input_stream_seek_fn,
    );
}
extern "C" {
    pub fn aws_crt_input_stream_options_set_read(
        options: *mut aws_crt_input_stream_options,
        read_fn: aws_crt_input_stream_read_fn,
    );
}
extern "C" {
    pub fn aws_crt_input_stream_options_set_get_status(
        options: *mut aws_crt_input_stream_options,
        get_status_fn: aws_crt_input_stream_get_status_fn,
    );
}
extern "C" {
    pub fn aws_crt_input_stream_options_set_get_length(
        options: *mut aws_crt_input_stream_options,
        get_length_fn: aws_crt_input_stream_get_length_fn,
    );
}
extern "C" {
    pub fn aws_crt_input_stream_options_set_destroy(
        options: *mut aws_crt_input_stream_options,
        destroy_fn: aws_crt_input_stream_destroy_fn,
    );
}
extern "C" {
    pub fn aws_crt_input_stream_new(
        options: *const aws_crt_input_stream_options,
    ) -> *mut aws_crt_input_stream;
}
extern "C" {
    pub fn aws_crt_input_stream_release(input_stream: *mut aws_crt_input_stream);
}
extern "C" {
    pub fn aws_crt_input_stream_seek(
        input_stream: *mut aws_crt_input_stream,
        offset: i64,
        seek_basis: aws_crt_input_stream_seek_basis,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aws_crt_input_stream_read(
        stream: *mut aws_crt_input_stream,
        dest: *mut u8,
        dest_length: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aws_crt_input_stream_get_status(
        stream: *mut aws_crt_input_stream,
        status: *mut aws_crt_input_stream_status,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aws_crt_input_stream_get_length(
        stream: *mut aws_crt_input_stream,
        length: *mut i64,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aws_crt_buf {
    pub blob: *mut u8,
    pub length: size_t,
}
#[test]
fn bindgen_test_layout_aws_crt_buf() {
    assert_eq!(
        ::std::mem::size_of::<aws_crt_buf>(),
        16usize,
        concat!("Size of: ", stringify!(aws_crt_buf))
    );
    assert_eq!(
        ::std::mem::align_of::<aws_crt_buf>(),
        8usize,
        concat!("Alignment of ", stringify!(aws_crt_buf))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<aws_crt_buf>())).blob as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aws_crt_buf),
            "::",
            stringify!(blob)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<aws_crt_buf>())).length as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aws_crt_buf),
            "::",
            stringify!(length)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _aws_crt_http_headers {
    _unused: [u8; 0],
}
pub type aws_crt_http_headers = _aws_crt_http_headers;
extern "C" {
    pub fn aws_crt_http_headers_new_from_blob(
        blob: *const u8,
        blob_length: size_t,
    ) -> *mut aws_crt_http_headers;
}
extern "C" {
    pub fn aws_crt_http_headers_acquire(
        headers: *mut aws_crt_http_headers,
    ) -> *mut aws_crt_http_headers;
}
extern "C" {
    pub fn aws_crt_http_headers_release(headers: *mut aws_crt_http_headers);
}
extern "C" {
    pub fn aws_crt_http_headers_to_blob(
        headers: *const aws_crt_http_headers,
        out_blob: *mut aws_crt_buf,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _aws_crt_http_message {
    _unused: [u8; 0],
}
pub type aws_crt_http_message = _aws_crt_http_message;
extern "C" {
