/* automatically generated by rust-bindgen 0.59.1 */

#![allow(dead_code)]
#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(deref_nullptr)]

pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
extern "C" {
    pub fn aws_crt_init();
}
extern "C" {
    pub fn aws_crt_clean_up();
}
extern "C" {
    pub fn aws_crt_test_error(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aws_crt_crypto_share();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aws_allocator {
    _unused: [u8; 0],
}
pub type aws_crt_allocator = aws_allocator;
extern "C" {
    pub fn aws_crt_default_allocator() -> *mut aws_crt_allocator;
}
extern "C" {
    pub fn aws_crt_mem_acquire(size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn aws_crt_mem_calloc(
        element_count: usize,
        element_size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn aws_crt_mem_release(mem: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn aws_crt_mem_bytes() -> u64;
}
extern "C" {
    pub fn aws_crt_mem_count() -> u64;
}
extern "C" {
    pub fn aws_crt_mem_dump();
}
extern "C" {
    pub fn aws_crt_resource_set_user_data(
        resource: *mut ::std::os::raw::c_void,
        user_data: *mut ::std::os::raw::c_void,

    pub fn aws_crt_log_stop();
}
impl _aws_crt_log_level {
    pub const AWS_CRT_LOG_NONE: _aws_crt_log_level = _aws_crt_log_level(0);
}
impl _aws_crt_log_level {
    pub const AWS_CRT_LOG_FATAL: _aws_crt_log_level = _aws_crt_log_level(1);
}
impl _aws_crt_log_level {
    pub const AWS_CRT_LOG_ERROR: _aws_crt_log_level = _aws_crt_log_level(2);
}
impl _aws_crt_log_level {
    pub const AWS_CRT_LOG_WARN: _aws_crt_log_level = _aws_crt_log_level(3);
}
impl _aws_crt_log_level {
    pub const AWS_CRT_LOG_INFO: _aws_crt_log_level = _aws_crt_log_level(4);
}
impl _aws_crt_log_level {
    pub const AWS_CRT_LOG_DEBUG: _aws_crt_log_level = _aws_crt_log_level(5);
}
impl _aws_crt_log_level {
    pub const AWS_CRT_LOG_TRACE: _aws_crt_log_level = _aws_crt_log_level(6);
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct _aws_crt_log_level(pub ::std::os::raw::c_uint);
pub use self::_aws_crt_log_level as aws_crt_log_level;
extern "C" {
    pub fn aws_crt_log_set_level(log_level: aws_crt_log_level);
}
extern "C" {
    pub fn aws_crt_log_message(level: aws_crt_log_level, message: *const u8, length: usize);
}
extern "C" {
    pub fn aws_crt_thread_join_all(timeout_ns: u64) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _aws_crt_event_loop_group {
    _unused: [u8; 0],
}
pub type aws_crt_event_loop_group = _aws_crt_event_loop_group;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _aws_crt_event_loop_group_options {
    _unused: [u8; 0],
}
pub type aws_crt_event_loop_group_options = _aws_crt_event_loop_group_options;
extern "C" {
    pub fn aws_crt_event_loop_group_options_new() -> *mut aws_crt_event_loop_group_options;
}
extern "C" {
    pub fn aws_crt_event_loop_group_options_release(options: *mut aws_crt_event_loop_group_options);
}
extern "C" {
    pub fn aws_crt_event_loop_group_options_set_max_threads(
        options: *mut aws_crt_event_loop_group_options,
        max_threads: u16,
    );
}
extern "C" {
    pub fn aws_crt_event_loop_group_new(
        options: *const aws_crt_event_loop_group_options,
    ) -> *mut aws_crt_event_loop_group;
}
extern "C" {
    pub fn aws_crt_event_loop_group_acquire(
        elg: *mut aws_crt_event_loop_group,
    ) -> *mut aws_crt_event_loop_group;
}
extern "C" {
    pub fn aws_crt_event_loop_group_release(elg: *mut aws_crt_event_loop_group);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _aws_crt_input_stream {
    _unused: [u8; 0],
}
pub type aws_crt_input_stream = _aws_crt_input_stream;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _aws_crt_input_stream_options {
    _unused: [u8; 0],
}
pub type aws_crt_input_stream_options = _aws_crt_input_stream_options;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _aws_crt_input_stream_status {
    pub is_end_of_stream: bool,
    pub is_valid: bool,
}
#[test]
fn bindgen_test_layout__aws_crt_input_stream_status() {
    assert_eq!(
        ::std::mem::size_of::<_aws_crt_input_stream_status>(),
        2usize,
        concat!("Size of: ", stringify!(_aws_crt_input_stream_status))
    );
    assert_eq!(
        ::std::mem::align_of::<_aws_crt_input_stream_status>(),
        1usize,
        concat!("Alignment of ", stringify!(_aws_crt_input_stream_status))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_aws_crt_input_stream_status>())).is_end_of_stream as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_aws_crt_input_stream_status),
            "::",
            stringify!(is_end_of_stream)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<_aws_crt_input_stream_status>())).is_valid as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(_aws_crt_input_stream_status),
            "::",
            stringify!(is_valid)
        )
    );
}
pub type aws_crt_input_stream_status = _aws_crt_input_stream_status;
impl aws_crt_input_stream_seek_basis {
    pub const AWS_CRT_STREAM_SEEK_BASIS_BEGIN: aws_crt_input_stream_seek_basis =
        aws_crt_input_stream_seek_basis(0);
}
impl aws_crt_input_stream_seek_basis {
    pub const AWS_CRT_STREAM_SEEK_BASIS_END: aws_crt_input_stream_seek_basis =
        aws_crt_input_stream_seek_basis(2);
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct aws_crt_input_stream_seek_basis(pub ::std::os::raw::c_uint);
pub type aws_crt_input_stream_seek_fn = ::std::option::Option<
    unsafe extern "C" fn(
        user_data: *mut ::std::os::raw::c_void,
        offset: i64,
        seek_basis: aws_crt_input_stream_seek_basis,
    ) -> ::std::os::raw::c_int,
>;
pub type aws_crt_input_stream_read_fn = ::std::option::Option<
    unsafe extern "C" fn(
        user_data: *mut ::std::os::raw::c_void,
        dest: *mut u8,
        dest_length: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type aws_crt_input_stream_get_status_fn = ::std::option::Option<
    unsafe extern "C" fn(
        user_data: *mut ::std::os::raw::c_void,
        out_status: *mut aws_crt_input_stream_status,
    ) -> ::std::os::raw::c_int,
>;
pub type aws_crt_input_stream_get_length_fn = ::std::option::Option<
    unsafe extern "C" fn(
        user_data: *mut ::std::os::raw::c_void,
        out_length: *mut i64,
    ) -> ::std::os::raw::c_int,
>;
pub type aws_crt_input_stream_destroy_fn =
    ::std::option::Option<unsafe extern "C" fn(user_data: *mut ::std::os::raw::c_void)>;
extern "C" {
    pub fn aws_crt_input_stream_options_new() -> *mut aws_crt_input_stream_options;
}
extern "C" {
    pub fn aws_crt_input_stream_options_release(options: *mut aws_crt_input_stream_options);
}
extern "C" {
    pub fn aws_crt_input_stream_options_set_user_data(
        options: *mut aws_crt_input_stream_options,
        user_data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn aws_crt_input_stream_options_set_seek(
        options: *mut aws_crt_input_stream_options,
        seek_fn: aws_crt_input_stream_seek_fn,
    );
}
extern "C" {
    pub fn aws_crt_input_stream_options_set_read(
        options: *mut aws_crt_input_stream_options,
        read_fn: aws_crt_input_stream_read_fn,
    );
}
extern "C" {
    pub fn aws_crt_input_stream_options_set_get_status(
        options: *mut aws_crt_input_stream_options,
        get_status_fn: aws_crt_input_stream_get_status_fn,
    );
}
extern "C" {
    pub fn aws_crt_input_stream_options_set_get_length(
        options: *mut aws_crt_input_stream_options,
        get_length_fn: aws_crt_input_stream_get_length_fn,
    );
}
extern "C" {
    pub fn aws_crt_input_stream_options_set_destroy(
        options: *mut aws_crt_input_stream_options,
        destroy_fn: aws_crt_input_stream_destroy_fn,
    );
}
extern "C" {
    pub fn aws_crt_input_stream_new(
        options: *const aws_crt_input_stream_options,
    ) -> *mut aws_crt_input_stream;
}
extern "C" {
    pub fn aws_crt_input_stream_release(input_stream: *mut aws_crt_input_stream);
}
extern "C" {
    pub fn aws_crt_input_stream_seek(
        input_stream: *mut aws_crt_input_stream,
        offset: i64,
        seek_basis: aws_crt_input_stream_seek_basis,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aws_crt_input_stream_read(
        stream: *mut aws_crt_input_stream,
        dest: *mut u8,
        dest_length: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aws_crt_input_stream_get_status(
        stream: *mut aws_crt_input_stream,
        status: *mut aws_crt_input_stream_status,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aws_crt_input_stream_get_length(
        stream: *mut aws_crt_input_stream,
        length: *mut i64,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct aws_crt_buf {
    pub blob: *mut u8,
    pub length: usize,
}
#[test]
fn bindgen_test_layout_aws_crt_buf() {
    assert_eq!(
        ::std::mem::size_of::<aws_crt_buf>(),
        16usize,
        concat!("Size of: ", stringify!(aws_crt_buf))
    );
    assert_eq!(
        ::std::mem::align_of::<aws_crt_buf>(),
        8usize,
        concat!("Alignment of ", stringify!(aws_crt_buf))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<aws_crt_buf>())).blob as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aws_crt_buf),
            "::",
            stringify!(blob)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<aws_crt_buf>())).length as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aws_crt_buf),
            "::",
            stringify!(length)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _aws_crt_http_headers {
    _unused: [u8; 0],
}
pub type aws_crt_http_headers = _aws_crt_http_headers;
extern "C" {
    pub fn aws_crt_http_headers_new_from_blob(
        blob: *const u8,
        blob_length: usize,
    ) -> *mut aws_crt_http_headers;
}
extern "C" {
    pub fn aws_crt_http_headers_acquire(
        headers: *mut aws_crt_http_headers,
    ) -> *mut aws_crt_http_headers;
}
extern "C" {
    pub fn aws_crt_http_headers_release(headers: *mut aws_crt_http_headers);
}
extern "C" {
    pub fn aws_crt_http_headers_to_blob(
        headers: *const aws_crt_http_headers,
        out_blob: *mut aws_crt_buf,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _aws_crt_http_message {
    _unused: [u8; 0],
}
pub type aws_crt_http_message = _aws_crt_http_message;
extern "C" {
